{
  "project": "ReSemis EPM",
  "branchName": "ralph/epm-dashboard-ui-hosting",
  "description": "Build a modern, dark-mode capable EPM web dashboard and package it for free-hosted collaboration.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create dashboard data adapter for UI views",
      "description": "As a frontend engineer, I want a normalized data adapter from scenario outputs so dashboard pages can render consistent KPIs and tables.",
      "acceptanceCriteria": [
        "Add module that transforms scenario outputs into monthly chart data and tabular datasets",
        "Expose helper functions for overview, teams, individuals, goals, and reviews views",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement Streamlit app shell and navigation",
      "description": "As a user, I want a clear app shell with left navigation and top controls so I can move across EPM sections quickly.",
      "acceptanceCriteria": [
        "Add Streamlit app entrypoint with left navigation for Overview, Teams, Individuals, Goals, Reviews, Settings",
        "Add scenario selector and date range controls in the app shell",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Build executive overview layout",
      "description": "As an executive, I want top KPI tiles and a chart/table grid so I can understand company-level performance in one view.",
      "acceptanceCriteria": [
        "Overview page includes 3 to 4 KPI tiles at top",
        "Overview page includes responsive chart and table grid below KPIs",
        "Overview page includes right-side contextual details panel",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Build manager and individual performance views",
      "description": "As a manager, I want team and individual views with filters and drill-down details so I can monitor and coach performance.",
      "acceptanceCriteria": [
        "Teams and Individuals pages render KPI cards, charts, and paginated tables",
        "Rows can be selected to populate contextual right-side details",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Add dark mode with tokenized theme system",
      "description": "As a user, I want a dark mode toggle that updates all key UI elements so the app is comfortable in different environments.",
      "acceptanceCriteria": [
        "Add persistent dark mode toggle",
        "Cards, charts, tables, navigation, and controls switch coherently between light and dark themes",
        "Add smooth transitions for color/background changes",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Capture design moodboard and UI verification screenshots",
      "description": "As a product lead, I want visual evidence files so we can review inspiration and confirm dark/light rendering quality.",
      "acceptanceCriteria": [
        "Add moodboard markdown with references and captured screenshots",
        "Add script to capture reference screenshots",
        "Add script/output screenshots for app light and dark modes",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Prepare free-host deployment configuration",
      "description": "As a collaborator, I want deployment docs and config so the app can be hosted for free and shared by URL.",
      "acceptanceCriteria": [
        "Add Streamlit deployment configuration and runtime requirements",
        "Add deployment guide for Streamlit Community Cloud and fallback free-host options",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    }
  ]
}
